app/controllers/home_controller.rb

  def index
    @message=Message.new
    @messages=Message.all
    @user=User.all
---
SELECT "messages".* FROM "messages"
SELECT "users".* FROM "users"